In [1]:
name <- c ("Amir","Ravi","Ankur","Shyam","Mohit")
age <- c(12,34,54,34,56)
child <- c(FALSE,TRUE,FALSE,TRUE,FALSE)

df1 <- data.frame(name,age,child,stringsAsFactors = FALSE)
df1

  name  age child
1 Amir  12  FALSE
2 Ravi  34   TRUE
3 Ankur 54  FALSE
4 Shyam 34   TRUE
5 Mohit 56  FALSE

In [6]:
df1[1,2]

[1] 12

In [7]:
df1[3,]

  name  age child
3 Ankur 54  FALSE

In [8]:
df1[,"age"]

[1] 12 34 54 34 56

In [10]:
df1[c(3,4),c("name","age")]

  name  age
3 Ankur 54
4 Shyam 34

In [12]:
df1[2]

  age
1 12
2 34
3 54
4 34
5 56

In [14]:
df1$age

[1] 12 34 54 34 56

In [15]:
df1[["age"]]

[1] 12 34 54 34 56

In [16]:
height <- c(123,213,234,125,128)
df1$height <- height
df1

  name  age child height
1 Amir  12  FALSE 123
2 Ravi  34   TRUE 213
3 Ankur 54  FALSE 234
4 Shyam 34   TRUE 125
5 Mohit 56  FALSE 128

In [17]:
weight <- c(45,34,56,78,59)
cbind(df1,weight)

  name  age child height weight
1 Amir  12  FALSE 123    45
2 Ravi  34   TRUE 213    34
3 Ankur 54  FALSE 234    56
4 Shyam 34   TRUE 125    78
5 Mohit 56  FALSE 128    59

In [22]:
 tom <- data.frame(name="Tom",age=49,child=FALSE,height=178)
df1=rbind(df1,tom)
df1

  name  age child height
1 Amir  12  FALSE 123
2 Ravi  34   TRUE 213
3 Ankur 54  FALSE 234
4 Shyam 34   TRUE 125
5 Mohit 56  FALSE 128
6 Tom   49  FALSE 178

In [23]:
sort(df1$age)

[1] 12 34 34 49 54 56

In [25]:
ranks <- order(df1$age)
ranks

[1] 1 2 4 6 3 5

In [26]:
df1[ranks,]

  name  age child height
1 Amir  12  FALSE 123
2 Ravi  34   TRUE 213
4 Shyam 34   TRUE 125
6 Tom   49  FALSE 178
3 Ankur 54  FALSE 234
5 Mohit 56  FALSE 128

In [27]:
df1[order(df1$height,decreasing=TRUE),]

  name  age child height
3 Ankur 54  FALSE 234
2 Ravi  34   TRUE 213
6 Tom   49  FALSE 178
5 Mohit 56  FALSE 128
4 Shyam 34   TRUE 125
1 Amir  12  FALSE 123